In [2]:
import numpy as np
import pandas as pd

In [4]:
letters = ['a','b','c']
numbers = [1,2,3]
np_arr = np.array(numbers)
dict = {'a':1,'b':2,'c':3}

In [12]:
pd.Series(data=numbers,index=letters)

1    1
2    2
3    3
dtype: int64

In [14]:
pd.Series(np_arr, letters)

a    1
b    2
c    3
dtype: int64

In [15]:
pd.Series(dict)

a    1
b    2
c    3
dtype: int64

In [16]:
pd.Series(letters)

0    a
1    b
2    c
dtype: object

In [17]:
rainbow = ['red','orange','yellow','green','blue','indigo','violet']
pd.Series(rainbow)

0       red
1    orange
2    yellow
3     green
4      blue
5    indigo
6    violet
dtype: object

In [128]:
list123 = np.random.randint(3,8,6)
index = ['a','b','c','d','e','f']
pd.Series(list123,index)

a    3
b    5
c    5
d    3
e    7
f    4
dtype: int64

In [29]:
type(list123)

numpy.ndarray

In [30]:
df = pd.DataFrame(np.random.randn(4,5),[1,2,3,4,],['red','orange','yellow','green','blue'])

In [32]:
df

        red    orange    yellow     green      blue
1  0.998591 -0.922679 -1.008179  0.172808 -0.227578
2  0.486641 -1.415197 -0.521553 -0.240552 -1.792438
3 -0.028240 -0.243085  0.883542 -1.237473 -1.246308
4 -0.288410  0.611471 -0.531183  1.006949 -0.803991

In [35]:
type(df['orange'])

pandas.core.series.Series

In [36]:
df['red']

1    0.998591
2    0.486641
3   -0.028240
4   -0.288410
Name: red, dtype: float64

In [38]:
type(df)

pandas.core.frame.DataFrame

In [39]:
df[['yellow','blue']]

     yellow      blue
1 -1.008179 -0.227578
2 -0.521553 -1.792438
3  0.883542 -1.246308
4 -0.531183 -0.803991

In [40]:
df['indigo'] = df['blue']

In [42]:
df

        red    orange    yellow     green      blue    indigo
1  0.998591 -0.922679 -1.008179  0.172808 -0.227578 -0.227578
2  0.486641 -1.415197 -0.521553 -0.240552 -1.792438 -1.792438
3 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -1.246308
4 -0.288410  0.611471 -0.531183  1.006949 -0.803991 -0.803991

In [43]:
df['violet'] = df['blue'] + df['indigo']

In [45]:
df

        red    orange    yellow     green      blue    indigo    violet
1  0.998591 -0.922679 -1.008179  0.172808 -0.227578 -0.227578 -0.455155
2  0.486641 -1.415197 -0.521553 -0.240552 -1.792438 -1.792438 -3.584875
3 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -1.246308 -2.492615
4 -0.288410  0.611471 -0.531183  1.006949 -0.803991 -0.803991 -1.607982

In [48]:
df.loc[2] = df.loc[3]

In [49]:
df

        red    orange    yellow     green      blue    indigo    violet
1  0.998591 -0.922679 -1.008179  0.172808 -0.227578 -0.227578 -0.455155
2 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -1.246308 -2.492615
3 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -1.246308 -2.492615
4 -0.288410  0.611471 -0.531183  1.006949 -0.803991 -0.803991 -1.607982

In [51]:
df.loc[4,'orange']

0.6114713224390964

In [52]:
df.loc[[1,3],['blue','violet']]

       blue    violet
1 -0.227578 -0.455155
3 -1.246308 -2.492615

In [54]:
df.drop(3)

        red    orange    yellow     green      blue    indigo    violet
1  0.998591 -0.922679 -1.008179  0.172808 -0.227578 -0.227578 -0.455155
2 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -1.246308 -2.492615
4 -0.288410  0.611471 -0.531183  1.006949 -0.803991 -0.803991 -1.607982

In [55]:
df

        red    orange    yellow     green      blue    indigo    violet
1  0.998591 -0.922679 -1.008179  0.172808 -0.227578 -0.227578 -0.455155
2 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -1.246308 -2.492615
3 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -1.246308 -2.492615
4 -0.288410  0.611471 -0.531183  1.006949 -0.803991 -0.803991 -1.607982

In [56]:
df.drop(3, inplace=True)

In [57]:
df

        red    orange    yellow     green      blue    indigo    violet
1  0.998591 -0.922679 -1.008179  0.172808 -0.227578 -0.227578 -0.455155
2 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -1.246308 -2.492615
4 -0.288410  0.611471 -0.531183  1.006949 -0.803991 -0.803991 -1.607982

In [62]:
df.drop('indigo',axis=1, inplace=True)

In [63]:
df

        red    orange    yellow     green      blue    violet
1  0.998591 -0.922679 -1.008179  0.172808 -0.227578 -0.455155
2 -0.028240 -0.243085  0.883542 -1.237473 -1.246308 -2.492615
4 -0.288410  0.611471 -0.531183  1.006949 -0.803991 -1.607982

In [65]:
df.shape

(3, 6)

In [71]:
country = ['France','Spain','Italy','Germany','Great Britain']
age = np.random.randint(1,101,35).reshape(7,5)
index = ['a','b','c','d','e','f','g']
pd.DataFrame(age,index,country)

   France  Spain  Italy  Germany  Great Britain
a       2      8     68       34             10
b      64     45     56       26             26
c      37     65     57       85             99
d       3      2     15       44             68
e      37     81     58       29             71
f       5      6     64       55             18
g      53     29     23       67              5

In [72]:
df = pd.DataFrame(np.random.randn(4,3),['a','b','c','d'],['X','Y','Z'])

In [74]:
df

          X         Y         Z
a -1.612555  0.056659 -0.281651
b -0.515925  1.760760  0.469011
c  1.301490 -0.040580 -0.643579
d  1.753245 -1.542180 -0.222870

In [75]:
df > 0

       X      Y      Z
a  False   True  False
b  False   True   True
c   True  False  False
d   True  False  False

In [76]:
bool_df = df > 0

In [78]:
bool_df

       X      Y      Z
a  False   True  False
b  False   True   True
c   True  False  False
d   True  False  False

In [79]:
df[bool_df]

          X         Y         Z
a       NaN  0.056659       NaN
b       NaN  1.760760  0.469011
c  1.301490       NaN       NaN
d  1.753245       NaN       NaN

In [80]:
df[df > 0]

          X         Y         Z
a       NaN  0.056659       NaN
b       NaN  1.760760  0.469011
c  1.301490       NaN       NaN
d  1.753245       NaN       NaN

In [81]:
df['Y'] > 1

a    False
b     True
c    False
d    False
Name: Y, dtype: bool

In [82]:
df

          X         Y         Z
a -1.612555  0.056659 -0.281651
b -0.515925  1.760760  0.469011
c  1.301490 -0.040580 -0.643579
d  1.753245 -1.542180 -0.222870

In [84]:
df[df['Y'] > 1]

          X        Y         Z
b -0.515925  1.76076  0.469011

In [86]:
res = df[df['X'] < 0]

In [88]:
res

          X         Y         Z
a -1.612555  0.056659 -0.281651
b -0.515925  1.760760  0.469011

In [94]:
res[['X','Z']]

          X         Z
a -1.612555 -0.281651
b -0.515925  0.469011

In [95]:
df

          X         Y         Z
a -1.612555  0.056659 -0.281651
b -0.515925  1.760760  0.469011
c  1.301490 -0.040580 -0.643579
d  1.753245 -1.542180 -0.222870

In [99]:
df.drop('a')

          X        Y         Z
b -0.515925  1.76076  0.469011
c  1.301490 -0.04058 -0.643579
d  1.753245 -1.54218 -0.222870

In [103]:
df = pd.DataFrame(np.random.randint(1,100,20).reshape(5,4),[10,20,30,40,50],['A','B','C','D'])

In [104]:
df

     A   B   C   D
10  28  89  52  24
20   7  35  60  73
30  97  83  83  65
40  99  67  73  92
50   1  97  58  55

In [105]:
df[df['A'] < 30]

     A   B   C   D
10  28  89  52  24
20   7  35  60  73
50   1  97  58  55

In [108]:
df[(df['A'] < 50) | (df['B'] < 40)]

     A   B   C   D
10  28  89  52  24
20   7  35  60  73
50   1  97  58  55

In [109]:
res = df[(df['C'] > 20) & (df['D'] < 70)]

In [110]:
res

     A   B   C   D
10  28  89  52  24
30  97  83  83  65
50   1  97  58  55

In [111]:
res[['A','B']]

     A   B
10  28  89
30  97  83
50   1  97

In [112]:
df[(df['C'] > 20) & (df['D'] < 70)][['A','B']]

     A   B
10  28  89
30  97  83
50   1  97